In [1]:
import numpy as np
import pandas as pd
#行索引可以直接更改
data.columns = [1,5,3,4]

In [19]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                     index = ['beijing','tokyo','new york'],
                    columns = ['one','two','there','four'])
data

          one  two  there  four
beijing     0    1      2     3
tokyo       4    5      6     7
new york    8    9     10    11

In [20]:
#在原始的轴索引下修改
tran = lambda x:x[:4].upper()
data.index.map(tran)
data.index = data.index.map(tran)
data

      one  two  there  four
BEIJ    0    1      2     3
TOKY    4    5      6     7
NEW     8    9     10    11

In [24]:
#不在原始的轴索引下修改
data.rename(index = str.title,columns = str.upper)
data.rename(index = {'TOKY':'东京'},columns={'there':'第三年'})

      one  two  第三年  four
BEIJ    0    1    2     3
东京      4    5    6     7
NEW     8    9   10    11